#### Terraform Plan (dev) 📖`success`

<details><summary>Show Plan</summary>

```terraform

aws_eip.vpc_eip["eu-north-1a"]: Refreshing state... [id=eipalloc-00417d8d96143ba0d]
aws_eip.vpc_eip["eu-north-1c"]: Refreshing state... [id=eipalloc-013d90f9a38df0070]
data.aws_vpc.conquer-vpc: Reading...
data.aws_iam_policy_document.assume_eks_role: Reading...
aws_eip.vpc_eip["eu-north-1b"]: Refreshing state... [id=eipalloc-0290ec2f796d339c7]
data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.assume_eks-worker_role: Reading...
data.aws_iam_policy_document.assume_eks_role: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_eks-worker_role: Read complete after 0s [id=2851119427]
aws_iam_role.eks_role: Refreshing state... [id=dev-conquer-eks-role]
aws_iam_role.eks_worker_role: Refreshing state... [id=dev-conquer-eks-worker-role]
data.aws_caller_identity.current: Read complete after 0s [id=014630368052]
aws_iam_role_policy_attachment.AmazonEKSClusterPolicy: Refreshing state... [id=dev-conquer-eks-role-20231028053135209800000001]
aws_iam_role_policy_attachment.AmazonEKSWorkerNodePolicy: Refreshing state... [id=dev-conquer-eks-worker-role-20231028053135382400000008]
aws_iam_role_policy_attachment.AmazonEKS_CNI_Policy: Refreshing state... [id=dev-conquer-eks-worker-role-20231028053135309600000004]
aws_iam_role_policy_attachment.AmazonEC2RoleforSSM: Refreshing state... [id=dev-conquer-eks-worker-role-20231028053135286100000002]
aws_iam_role_policy_attachment.AmazonEC2ContainerRegistryReadOnly: Refreshing state... [id=dev-conquer-eks-worker-role-20231028053135339400000007]
data.aws_vpc.conquer-vpc: Read complete after 2s [id=vpc-0e724d4c7ed376ef9]
aws_subnet.eks_subnets_public["eu-north-1c"]: Refreshing state... [id=subnet-06019697c7efe990a]
aws_subnet.eks_subnets_public["eu-north-1b"]: Refreshing state... [id=subnet-03acc10f100b3b770]
aws_subnet.eks_subnets_private["eu-north-1b"]: Refreshing state... [id=subnet-08f3011579f966015]
aws_route_table.private_subnet_rt["eu-north-1c"]: Refreshing state... [id=rtb-05f4712fa6ee90d03]
aws_subnet.eks_subnets_public["eu-north-1a"]: Refreshing state... [id=subnet-01cc2caf3fcd4b12a]
aws_internet_gateway.igw: Refreshing state... [id=igw-0a5d9263ef93d2c1c]
aws_route_table.private_subnet_rt["eu-north-1a"]: Refreshing state... [id=rtb-0f470bd251916e38f]
aws_subnet.eks_subnets_private["eu-north-1c"]: Refreshing state... [id=subnet-047b36c3f1e63a7c2]
aws_subnet.eks_subnets_private["eu-north-1a"]: Refreshing state... [id=subnet-08d4d39ba94759a2b]
aws_route_table.private_subnet_rt["eu-north-1b"]: Refreshing state... [id=rtb-0791314aff021d91d]
aws_nat_gateway.nat_gw["eu-north-1c"]: Refreshing state... [id=nat-09f81829334ab2b31]
aws_nat_gateway.nat_gw["eu-north-1a"]: Refreshing state... [id=nat-0d9dc8ccbf23ee30b]
aws_nat_gateway.nat_gw["eu-north-1b"]: Refreshing state... [id=nat-03f2f297ab315c826]
aws_eks_cluster.eks: Refreshing state... [id=dev-conquer-cluster]
aws_default_route_table.vpc_default_rt: Refreshing state... [id=rtb-0dc8418d9e2d2076f]
aws_route_table_association.private_subnet_rt_association["eu-north-1b"]: Refreshing state... [id=rtbassoc-08a0adc4f04e758cd]
aws_route_table_association.private_subnet_rt_association["eu-north-1c"]: Refreshing state... [id=rtbassoc-0f1ade676e82013c2]
aws_route_table_association.private_subnet_rt_association["eu-north-1a"]: Refreshing state... [id=rtbassoc-0fcb42257d6563fa1]
aws_route.nat_access["eu-north-1c"]: Refreshing state... [id=r-rtb-05f4712fa6ee90d031080289494]
aws_route.nat_access["eu-north-1a"]: Refreshing state... [id=r-rtb-0f470bd251916e38f1080289494]
aws_route.nat_access["eu-north-1b"]: Refreshing state... [id=r-rtb-0791314aff021d91d1080289494]
aws_eks_node_group.node-group["eu-north-1b"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-1]
data.tls_certificate.eks: Reading...
aws_eks_node_group.node-group["eu-north-1c"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-2]
aws_eks_addon.example: Refreshing state... [id=dev-conquer-cluster:vpc-cni]
aws_eks_node_group.node-group["eu-north-1a"]: Refreshing state... [id=dev-conquer-cluster:dev-conquer-node-group-0]
helm_release.argocd: Refreshing state... [id=argocd]
data.tls_certificate.eks: Read complete after 0s [id=5007ea61dfb4fcd4db18c0c232d56bef3b07d3dc]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.aws-ebs-csi-driver will be created
  + resource "aws_eks_addon" "aws-ebs-csi-driver" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "dev-conquer-cluster"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + resolve_conflicts_on_update = "PRESERVE"
      + service_account_role_arn    = (known after apply)
      + tags_all                    = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
    }

  # aws_iam_openid_connect_provider.eks-idp will be created
  + resource "aws_iam_openid_connect_provider" "eks-idp" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = "https://oidc.eks.eu-north-1.amazonaws.com/id/E6D4A5F9443A11D36A097119FFE0CEB5"
    }

  # aws_iam_role.AmazonEKS_EBS_CSI_DriverRole will be created
  + resource "aws_iam_role" "AmazonEKS_EBS_CSI_DriverRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringLike = {
                              + "oidc.eks.eu-north-1.amazonaws.com/id/E6D4A5F9443A11D36A097119FFE0CEB5:aud" = "sts.amazonaws.com"
                              + "oidc.eks.eu-north-1.amazonaws.com/id/E6D4A5F9443A11D36A097119FFE0CEB5:sub" = "system:serviceaccount:kube-system:ebs-csi-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::014630368052:oidc-provider/oidc.eks.eu-north-1.amazonaws.com/id/E6D4A5F9443A11D36A097119FFE0CEB5"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "AmazonEKS_EBS_CSI_DriverRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "owners"  = "the-devops-guys"
          + "project" = "dev-conquer"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.AmazonEBSCSIDriverPolicy-attachment will be created
  + resource "aws_iam_role_policy_attachment" "AmazonEBSCSIDriverPolicy-attachment" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = "AmazonEKS_EBS_CSI_DriverRole"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.out"

```

</details>

*Pusher: @benhur-araujo, Action: `pull_request`, Working Directory: ``, Workflow: `create-ephemeral-resources`*